seasons_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень",  "Осень",  "Осень", "Зима"]
seasons_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",  10: "Осень",  11: "Осень", 12: "Зима"}
try:
    season = int(input("Введите номер месяца от 1 до 12 "))
    if season < 1 or season > 12:
        raise ValueError("Число должно быть от 1 до 12")
    print(f"Время года - {seasons_list[season - 1]}, повторяю {seasons_dict[season]}")
except ValueError as e:
    print(f"Неверные данные: {e}")
